Repository: vibe-ir/woocommerce-gateway-vibe
Catalog: i18n/languages/woocommerce-gateway-vibe-*.po
Languages: fa_ir

source: WooCommerce Vibe Payment Gateway
fa_ir: درگاه پرداخت وایب ووکامرس

source: Adds the Vibe Payment gateway to your WooCommerce website with dynamic pricing based on referrer detection.
fa_ir: درگاه پرداخت وایب را به وب‌سایت ووکامرس شما اضافه می‌کند با قیمت‌گذاری پویا بر اساس تشخیص منبع ارجاع.

source: Vibe
fa_ir: وایب

source: Vibe Payment
fa_ir: پرداخت وایب

source: Allows payments through Vibe Payment Gateway.
fa_ir: امکان پرداخت از طریق درگاه پرداخت وایب را فراهم می‌کند.

source: Enable/Disable
fa_ir: فعال/غیرفعال

source: Enable Vibe Payments
fa_ir: فعال‌سازی پرداخت‌های وایب

source: Title
fa_ir: عنوان

source: This controls the title which the user sees during checkout.
fa_ir: این گزینه عنوانی را که کاربر در هنگام تسویه حساب می‌بیند کنترل می‌کند.

source: Description
fa_ir: توضیحات

source: Payment method description that the customer will see on your checkout.
fa_ir: توضیحات روش پرداخت که مشتری در صفحه تسویه حساب خواهد دید.

source: Pay with Vibe Payment Gateway.
fa_ir: پرداخت با درگاه پرداخت وایب.

source: Merchant API Key
fa_ir: کلید API پذیرنده

source: Enter your Vibe Payment Gateway Merchant API Key.
fa_ir: کلید API پذیرنده درگاه پرداخت وایب خود را وارد کنید.

source: Debug Mode
fa_ir: حالت اشکال‌زدایی

source: Enable logging for debugging
fa_ir: فعال‌سازی ثبت رویدادها برای اشکال‌زدایی

source: Log payment gateway events to help troubleshoot issues.
fa_ir: ثبت رویدادهای درگاه پرداخت برای کمک به حل مشکلات.

source: Unknown error occurred while processing the payment.
fa_ir: خطای نامشخصی در هنگام پردازش پرداخت رخ داد.

source: Invalid response from Vibe Payment Gateway.
fa_ir: پاسخ نامعتبر از درگاه پرداخت وایب.

source: Vibe Payment Gateway error:
fa_ir: خطای درگاه پرداخت وایب:

source: Invalid payment response. Missing required parameters.
fa_ir: پاسخ پرداخت نامعتبر. پارامترهای ضروری موجود نیست.

source: Payment Error
fa_ir: خطای پرداخت

source: Order not found.
fa_ir: سفارش یافت نشد.

source: Payment completed via Vibe. Reference ID: %1$s, UUID: %2$s
fa_ir: پرداخت از طریق وایب تکمیل شد. شناسه مرجع: %1$s، UUID: %2$s

source: Payment Successful
fa_ir: پرداخت موفق

source: Your payment has been processed successfully. Redirecting to order confirmation...
fa_ir: پرداخت شما با موفقیت پردازش شد. در حال هدایت به تایید سفارش...

source: Payment failed or was declined.
fa_ir: پرداخت ناموفق بود یا رد شد.

source: Payment Failed
fa_ir: پرداخت ناموفق

source: Your payment could not be processed. Redirecting to checkout...
fa_ir: پرداخت شما قابل پردازش نبود. در حال هدایت به صفحه تسویه حساب...

source: Vibe Dynamic Pricing
fa_ir: قیمت‌گذاری پویای وایب

source: Vibe Pricing
fa_ir: قیمت‌گذاری وایب

source: Pricing Rules
fa_ir: قوانین قیمت‌گذاری

source: Rules
fa_ir: قوانین

source: Display Settings
fa_ir: تنظیمات نمایش

source: Display
fa_ir: نمایش

source: Performance
fa_ir: عملکرد

source: Add Rule
fa_ir: افزودن قانون

source: Bulk Actions
fa_ir: عملیات گروهی

source: Enable
fa_ir: فعال

source: Disable
fa_ir: غیرفعال

source: Delete
fa_ir: حذف

source: Apply
fa_ir: اعمال

source: Add New Rule
fa_ir: افزودن قانون جدید

source: Rule Name
fa_ir: نام قانون

source: Priority
fa_ir: اولویت

source: Product Targeting
fa_ir: هدف‌گیری محصول

source: Price Adjustment
fa_ir: تعدیل قیمت

source: Status
fa_ir: وضعیت

source: Actions
fa_ir: عملیات

source: No pricing rules found.
fa_ir: هیچ قانون قیمت‌گذاری یافت نشد.

source: Create your first rule
fa_ir: اولین قانون خود را ایجاد کنید

source: All Products
fa_ir: تمام محصولات

source: Specific Products
fa_ir: محصولات خاص

source: %d product
fa_ir: %d محصول

source: Categories
fa_ir: دسته‌بندی‌ها

source: %d category
fa_ir: %d دسته‌بندی

source: Tags
fa_ir: برچسب‌ها

source: %d tag
fa_ir: %d برچسب

source: Price Range
fa_ir: محدوده قیمت

source: Complex Logic
fa_ir: منطق پیچیده

source: Active
fa_ir: فعال

source: Inactive
fa_ir: غیرفعال

source: Edit
fa_ir: ویرایش

source: Are you sure you want to delete this rule?
fa_ir: آیا مطمئن هستید که می‌خواهید این قانون را حذف کنید؟

source: A descriptive name for this pricing rule.
fa_ir: نام توصیفی برای این قانون قیمت‌گذاری.

source: Optional description of what this rule does.
fa_ir: توضیحات اختیاری از کارکرد این قانون.

source: Higher priority rules are applied first. Use 0 for lowest priority.
fa_ir: قوانین با اولویت بالاتر ابتدا اعمال می‌شوند. از 0 برای کمترین اولویت استفاده کنید.

source: Referrer Requirements
fa_ir: الزامات منبع ارجاع

source: Automatically applies to vibe.ir and all subdomains (*.vibe.ir)
fa_ir: به‌طور خودکار برای vibe.ir و تمام زیردامنه‌ها (*.vibe.ir) اعمال می‌شود

source: This rule will only apply to visitors coming from vibe.ir or any of its subdomains.
fa_ir: این قانون فقط برای بازدیدکنندگانی که از vibe.ir یا زیردامنه‌های آن می‌آیند اعمال خواهد شد.

source: Hold Ctrl/Cmd to select multiple products.
fa_ir: برای انتخاب چندین محصول کلید Ctrl/Cmd را نگه دارید.

source: Product Categories
fa_ir: دسته‌بندی‌های محصول

source: Logic:
fa_ir: منطق:

source: Any of selected categories (OR)
fa_ir: هر یک از دسته‌بندی‌های انتخابی (یا)

source: All selected categories (AND)
fa_ir: تمام دسته‌بندی‌های انتخابی (و)

source: Product Tags
fa_ir: برچسب‌های محصول

source: Any of selected tags (OR)
fa_ir: هر یک از برچسب‌های انتخابی (یا)

source: All selected tags (AND)
fa_ir: تمام برچسب‌های انتخابی (و)

source: Minimum Price:
fa_ir: حداقل قیمت:

source: Maximum Price:
fa_ir: حداکثر قیمت:

source: Leave empty for no limit. Applies to products within this price range.
fa_ir: برای عدم محدودیت خالی بگذارید. برای محصولات در این محدوده قیمت اعمال می‌شود.

source: Build complex conditions like: ((Category A AND Tag X) OR (Category B AND Tag Y)) AND Price > $50
fa_ir: شرایط پیچیده بسازید مانند: ((دسته A و برچسب X) یا (دسته B و برچسب Y)) و قیمت > 50 دلار

source: Syntax: category:slug, tag:slug, price > amount, price < amount, price = amount. Use AND, OR, parentheses for grouping.
fa_ir: نحو: category:slug، tag:slug، price > amount، price < amount، price = amount. از AND، OR، پرانتز برای گروه‌بندی استفاده کنید.

source: Percentage Adjustment
fa_ir: تعدیل درصدی

source: Fixed Amount Addition/Subtraction
fa_ir: اضافه/کم کردن مبلغ ثابت

source: Fixed Price Override
fa_ir: تنظیم قیمت ثابت

source: Price Adjustment Types:
fa_ir: انواع تعدیل قیمت:

source: Percentage:
fa_ir: درصدی:

source: +10 = 10% increase, -5 = 5% decrease from original price
fa_ir: +10 = افزایش 10 درصدی، -5 = کاهش 5 درصدی از قیمت اصلی

source: Fixed Amount:
fa_ir: مبلغ ثابت:

source: +10 = add $10, -5 = subtract $5 from original price
fa_ir: +10 = اضافه کردن 10 دلار، -5 = کم کردن 5 دلار از قیمت اصلی

source: Fixed Price:
fa_ir: قیمت ثابت:

source: 25 = set price to exactly $25 regardless of original price
fa_ir: 25 = تنظیم قیمت دقیقاً 25 دلار صرف‌نظر از قیمت اصلی

source: Discount Integration
fa_ir: یکپارچه‌سازی تخفیف

source: Apply with existing WooCommerce discounts
fa_ir: اعمال همراه با تخفیف‌های موجود ووکامرس

source: Ignore existing discounts (replace them)
fa_ir: نادیده گرفتن تخفیف‌های موجود (جایگزینی آن‌ها)

source: Apply before other discounts
fa_ir: اعمال قبل از سایر تخفیف‌ها

source: Choose how this rule interacts with existing WooCommerce coupons and discounts.
fa_ir: انتخاب کنید این قانون چگونه با کوپن‌ها و تخفیف‌های موجود ووکامرس تعامل کند.

source: Enable this rule
fa_ir: فعال‌سازی این قانون

source: Update Rule
fa_ir: به‌روزرسانی قانون

source: Create Rule
fa_ir: ایجاد قانون

source: Cancel
fa_ir: لغو

source: Configure how dynamic prices are displayed to customers.
fa_ir: نحوه نمایش قیمت‌های پویا به مشتریان را پیکربندی کنید.

source: Enable Dynamic Pricing
fa_ir: فعال‌سازی قیمت‌گذاری پویا

source: Enable dynamic pricing functionality
fa_ir: فعال‌سازی عملکرد قیمت‌گذاری پویا

source: Master switch to enable or disable all dynamic pricing features.
fa_ir: کلید اصلی برای فعال یا غیرفعال کردن تمام ویژگی‌های قیمت‌گذاری پویا.

source: Apply Pricing Based On
fa_ir: اعمال قیمت‌گذاری بر اساس

source: Referrer OR Payment Gateway (Recommended)
fa_ir: منبع ارجاع یا درگاه پرداخت (پیشنهادی)

source: Apply dynamic pricing when visitors come from vibe.ir OR when they select Vibe payment gateway. This provides the best coverage while preventing double pricing application.
fa_ir: قیمت‌گذاری پویا را زمانی اعمال کنید که بازدیدکنندگان از vibe.ir بیایند یا درگاه پرداخت وایب را انتخاب کنند. این بهترین پوشش را فراهم می‌کند و از اعمال دوگانه قیمت‌گذاری جلوگیری می‌کند.

source: Payment Gateway Only
fa_ir: فقط درگاه پرداخت

source: Apply dynamic pricing only when customers select Vibe payment gateway during checkout, with referrer fallback on product pages.
fa_ir: قیمت‌گذاری پویا را فقط زمانی اعمال کنید که مشتریان در هنگام تسویه حساب درگاه پرداخت وایب را انتخاب کنند، با پشتیبان منبع ارجاع در صفحات محصول.

source: Referrer Detection Only (Legacy)
fa_ir: فقط تشخیص منبع ارجاع (قدیمی)

source: Apply pricing only when visitors come from vibe.ir domains. Less reliable as referrer information can be lost during navigation.
fa_ir: قیمت‌گذاری را فقط زمانی اعمال کنید که بازدیدکنندگان از دامنه‌های vibe.ir بیایند. کمتر قابل اعتماد چون اطلاعات منبع ارجاع ممکن است در طول مرور از بین برود.

source: Always Apply (All Visitors)
fa_ir: همیشه اعمال (تمام بازدیدکنندگان)

source: Apply dynamic pricing to all visitors regardless of referrer or payment method. Use with caution as this affects all customers.
fa_ir: قیمت‌گذاری پویا را برای تمام بازدیدکنندگان صرف‌نظر از منبع ارجاع یا روش پرداخت اعمال کنید. با احتیاط استفاده کنید چون این بر تمام مشتریان تأثیر می‌گذارد.

source: Emergency Disable
fa_ir: غیرفعال‌سازی اضطراری

source: Disable all dynamic pricing
fa_ir: غیرفعال کردن تمام قیمت‌گذاری پویا

source: Use this to quickly disable all dynamic pricing functionality in case of issues.
fa_ir: از این گزینه برای غیرفعال کردن سریع تمام عملکرد قیمت‌گذاری پویا در صورت بروز مشکل استفاده کنید.

source: Show Both Prices
fa_ir: نمایش هر دو قیمت

source: Show both original and dynamic prices
fa_ir: نمایش قیمت اصلی و پویا

source: When enabled, both the new dynamic price and original price will be displayed.
fa_ir: زمانی که فعال باشد، هم قیمت پویای جدید و هم قیمت اصلی نمایش داده خواهد شد.

source: Price Order
fa_ir: ترتیب قیمت

source: Dynamic Price First
fa_ir: ابتدا قیمت پویا

source: Original Price First
fa_ir: ابتدا قیمت اصلی

source: Choose which price to display first when showing both prices.
fa_ir: انتخاب کنید هنگام نمایش هر دو قیمت، کدام قیمت ابتدا نمایش داده شود.

source: Display Layout
fa_ir: چیدمان نمایش

source: Inline (side by side)
fa_ir: درخط (کنار هم)

source: Two lines (stacked)
fa_ir: دو خط (روی هم)

source: Choose how to display both prices when enabled.
fa_ir: انتخاب کنید هنگام فعال بودن، هر دو قیمت چگونه نمایش داده شوند.

source: Original Price Style
fa_ir: سبک قیمت اصلی

source: Strike through original price
fa_ir: خط زدن روی قیمت اصلی

source: Apply line-through style to the original price to show it as a discount.
fa_ir: سبک خط زدن روی قیمت اصلی را اعمال کنید تا آن را به عنوان تخفیف نشان دهد.

source: Font Sizes
fa_ir: اندازه‌های فونت

source: Dynamic Price Font Size:
fa_ir: اندازه فونت قیمت پویا:

source: Original Price Font Size:
fa_ir: اندازه فونت قیمت اصلی:

source: Set font sizes using CSS units (%, px, em). Examples: 100%, 14px, 1.2em
fa_ir: اندازه فونت را با استفاده از واحدهای CSS (%, px, em) تنظیم کنید. مثال‌ها: 100%، 14px، 1.2em

source: Price Prefixes & Suffixes
fa_ir: پیشوند و پسوند قیمت

source: Dynamic Price
fa_ir: قیمت پویا

source: Special pricing for Vibe users
fa_ir: قیمت‌گذاری ویژه برای کاربران وایب

source: Prefix
fa_ir: پیشوند

source: e.g., Special Price:
fa_ir: مثلاً، قیمت ویژه:

source: Suffix
fa_ir: پسوند

source: e.g., (Save 10%)
fa_ir: مثلاً، (10% صرفه‌جویی)

source: Original Price
fa_ir: قیمت اصلی

source: Standard pricing for reference
fa_ir: قیمت‌گذاری استاندارد برای مرجع

source: e.g., Regular Price:
fa_ir: مثلاً، قیمت عادی:

source: e.g., (was)
fa_ir: مثلاً، (قبلاً)

source: Live Preview
fa_ir: پیش‌نمایش زنده

source: Customize the text that appears before and after each price. The preview shows how prices will appear on your product pages.
fa_ir: متنی که قبل و بعد از هر قیمت ظاهر می‌شود را سفارشی کنید. پیش‌نمایش نشان می‌دهد قیمت‌ها چگونه در صفحات محصول شما ظاهر خواهند شد.

source: Pricing Badge
fa_ir: نشان قیمت‌گذاری

source: Show pricing badge
fa_ir: نمایش نشان قیمت‌گذاری

source: Badge Text:
fa_ir: متن نشان:

source: Badge Color:
fa_ir: رنگ نشان:

source: Display a colored badge next to dynamic prices to highlight the special pricing.
fa_ir: نشان رنگی کنار قیمت‌های پویا نمایش دهید تا قیمت‌گذاری ویژه را برجسته کنید.

source: Conditional Display
fa_ir: نمایش شرطی

source: Show dynamic prices only when conditions are met
fa_ir: قیمت‌های پویا را فقط زمانی نمایش دهید که شرایط برآورده شوند

source: When enabled, dynamic prices are shown only when appropriate (e.g., Vibe payment method selected). When disabled, dynamic prices are always shown if applicable.
fa_ir: زمانی که فعال باشد، قیمت‌های پویا فقط در مواقع مناسب نمایش داده می‌شوند (مثلاً، روش پرداخت وایب انتخاب شده). زمانی که غیرفعال باشد، قیمت‌های پویا همیشه در صورت اعمال نمایش داده می‌شوند.

source: Save Settings
fa_ir: ذخیره تنظیمات

source: Cache Statistics
fa_ir: آمار کش

source: Object Cache Enabled
fa_ir: کش شیء فعال

source: Yes
fa_ir: بله

source: No
fa_ir: خیر

source: Database Cache Entries
fa_ir: ورودی‌های کش پایگاه داده

source: Database Cache Size
fa_ir: اندازه کش پایگاه داده

source: Transient Entries
fa_ir: ورودی‌های موقت

source: Are you sure you want to clear all pricing caches?
fa_ir: آیا مطمئن هستید که می‌خواهید تمام کش‌های قیمت‌گذاری را پاک کنید؟

source: Clear All Caches
fa_ir: پاک کردن تمام کش‌ها

source: Security check failed
fa_ir: بررسی امنیتی ناموفق بود

source: Rule updated successfully.
fa_ir: قانون با موفقیت به‌روزرسانی شد.

source: Rule created successfully.
fa_ir: قانون با موفقیت ایجاد شد.

source: Rule deleted successfully.
fa_ir: قانون با موفقیت حذف شد.

source: Rule status updated.
fa_ir: وضعیت قانون به‌روزرسانی شد.

source: Settings saved successfully.
fa_ir: تنظیمات با موفقیت ذخیره شد.

source: Cache cleared successfully.
fa_ir: کش با موفقیت پاک شد.

source: Permission denied
fa_ir: دسترسی مجاز نیست

source: Settings
fa_ir: تنظیمات

source: Debug logs cleared successfully.
fa_ir: گزارش‌های اشکال‌زدایی با موفقیت پاک شدند.

source: Debug settings saved successfully.
fa_ir: تنظیمات اشکال‌زدایی با موفقیت ذخیره شدند.

source: Display settings saved successfully.
fa_ir: تنظیمات نمایش با موفقیت ذخیره شدند.

source: Pricing rules processing - method needs implementation.
fa_ir: پردازش قوانین قیمت‌گذاری - روش نیاز به پیاده‌سازی دارد.

source: Vibe API
fa_ir: API وایب

source: API Endpoints
fa_ir: نقاط پایانی API

source: Use these endpoints to access your product information. Click the copy button to copy the URL to your clipboard.
fa_ir: از این نقاط پایانی برای دسترسی به اطلاعات محصولات خود استفاده کنید. روی دکمه کپی کلیک کنید تا URL در کلیپ‌بورد کپی شود.

source: Product List Endpoint
fa_ir: نقطه پایانی لیست محصولات

source: Copy
fa_ir: کپی

source: Endpoint for retrieving a list of products. Supports pagination with page and size parameters.
fa_ir: نقطه پایانی برای دریافت لیست محصولات. از صفحه‌بندی با پارامترهای page و size پشتیبانی می‌کند.

source: Example:
fa_ir: مثال:

source: Product Details Endpoint
fa_ir: نقطه پایانی جزئیات محصول

source: Endpoint for retrieving details of a specific product. Replace {product_id} with the actual product ID.
fa_ir: نقطه پایانی برای دریافت جزئیات محصول خاص. {product_id} را با شناسه واقعی محصول جایگزین کنید.

source: Share Endpoints
fa_ir: اشتراک‌گذاری نقاط پایانی

source: Share via Email
fa_ir: اشتراک‌گذاری از طریق ایمیل

source: Share these endpoints with your integration partner via email.
fa_ir: این نقاط پایانی را با شریک یکپارچه‌سازی خود از طریق ایمیل به اشتراک بگذارید.

source: Copied!
fa_ir: کپی شد!

source: Vibe API Endpoints
fa_ir: نقاط پایانی API وایب

source: Here are the API endpoints for accessing our product information:
fa_ir: در اینجا نقاط پایانی API برای دسترسی به اطلاعات محصولات ما آمده است:

source: Product List Endpoint:
fa_ir: نقطه پایانی لیست محصولات:

source: Product Details Endpoint:
fa_ir: نقطه پایانی جزئیات محصول:

source: Note: API authentication is enabled. You will need to include the following API key in the X-Vibe-API-Key header of your requests:
fa_ir: توجه: احراز هویت API فعال است. باید کلید API زیر را در هدر X-Vibe-API-Key درخواست‌های خود قرار دهید:

source: Vibe Product Information Collection API
fa_ir: API جمع‌آوری اطلاعات محصولات وایب

source: Configure the settings for the Vibe Product Information Collection API.
fa_ir: تنظیمات API جمع‌آوری اطلاعات محصولات وایب را پیکربندی کنید.

source: Enable API Authentication
fa_ir: فعال‌سازی احراز هویت API

source: Enable API key authentication for the Vibe Product Information Collection API.
fa_ir: فعال‌سازی احراز هویت کلید API برای API جمع‌آوری اطلاعات محصولات وایب.

source: API Key
fa_ir: کلید API

source: API key for authenticating requests to the Vibe Product Information Collection API. This key must be included in the X-Vibe-API-Key header of API requests.
fa_ir: کلید API برای احراز هویت درخواست‌های API جمع‌آوری اطلاعات محصولات وایب. این کلید باید در هدر X-Vibe-API-Key درخواست‌های API قرار گیرد.

source: Generate New API Key
fa_ir: تولید کلید API جدید

source: Check this box and save changes to generate a new API key. Warning: This will invalidate the existing key.
fa_ir: این گزینه را علامت بزنید و تغییرات را ذخیره کنید تا کلید API جدید تولید شود. هشدار: این کار کلید موجود را باطل می‌کند.

source: API Settings
fa_ir: تنظیمات API

source: Vibe Payment Gateway Warning:
fa_ir: هشدار درگاه پرداخت وایب:

source: The WordPress REST API appears to be disabled on your site. The Vibe Product Information Collection API requires the WordPress REST API to function properly. Please enable the REST API or check with your hosting provider.
fa_ir: به نظر می‌رسد WordPress REST API در سایت شما غیرفعال است. API جمع‌آوری اطلاعات محصولات وایب برای عملکرد صحیح به WordPress REST API نیاز دارد. لطفاً REST API را فعال کنید یا با ارائه‌دهنده هاستینگ خود تماس بگیرید.

source: Check Permalink Settings
fa_ir: بررسی تنظیمات پیوند یکتا

source: Learn More About REST API
fa_ir: درباره REST API بیشتر بدانید

source: Page number
fa_ir: شماره صفحه

source: Number of products per page
fa_ir: تعداد محصولات در هر صفحه

source: Product ID
fa_ir: شناسه محصول

source: WooCommerce is not active
fa_ir: ووکامرس فعال نیست

source: API key is required. Please include the X-Vibe-API-Key header in your request.
fa_ir: کلید API ضروری است. لطفاً هدر X-Vibe-API-Key را در درخواست خود قرار دهید.

source: Invalid API key.
fa_ir: کلید API نامعتبر.

source: Required WooCommerce function is missing
fa_ir: تابع ضروری ووکامرس موجود نیست

source: Required WooCommerce functions are missing
fa_ir: توابع ضروری ووکامرس موجود نیست

source: Product not found
fa_ir: محصول یافت نشد

source: Dynamic Pricing Adjustment
fa_ir: تعدیل قیمت‌گذاری پویا

source: Dynamic Pricing Discount
fa_ir: تخفیف قیمت‌گذاری پویا

source: WooCommerce Vibe Payment Gateway requires WooCommerce to be active for dynamic pricing features.
fa_ir: درگاه پرداخت وایب ووکامرس برای ویژگی‌های قیمت‌گذاری پویا نیاز به فعال بودن ووکامرس دارد.

source: WooCommerce Vibe Dynamic Pricing failed to initialize: %s
fa_ir: قیمت‌گذاری پویای وایب ووکامرس نتوانست راه‌اندازی شود: %s
